ext_wb/InformationRegisters/АЛСАВ_WB_НастройкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АЛСАВ_WB_НастройкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_wb/InformationRegisters/АЛСАВ_WB_СопоставлениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АЛСАВ_WB_СопоставлениеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>АртикулWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БаркодWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_wb/Enums/АЛСАВ_WB_ТипыОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АЛСАВ_WB_ТипыОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_wb/CommonModules/АЛСАВ_WB_ОбменДанными/Ext/Module.bsl
Функция ПолучитьНастройку(ИмяПараметра) Экспорт
	
	Отбор = Новый Структура("Параметр", ИмяПараметра);
	Запись = РегистрыСведений.АЛСАВ_WB_НастройкиОбмена.Получить(Отбор);
	
	Если Запись.Выбрать() Тогда
		Возврат Запись.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьНастройку(ИмяПараметра, Значение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.АЛСАВ_WB_НастройкиОбмена.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Параметр = ИмяПараметра;
	МенеджерЗаписи.Значение = Строка(Значение);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьСопоставлениеНоменклатуры(Номенклатура, Характеристика = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Характеристика", Характеристика);
	
	Запись = РегистрыСведений.АЛСАВ_WB_СопоставлениеНоменклатуры.Получить(Отбор);
	
	Если Запись.Выбрать() Тогда
		Результат = Новый Структура;
		Результат.Вставить("АртикулWB", Запись.АртикулWB);
		Результат.Вставить("БаркодWB", Запись.БаркодWB);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьСопоставлениеНоменклатуры(Номенклатура, АртикулWB, БаркодWB = "", Характеристика = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.АЛСАВ_WB_СопоставлениеНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Характеристика = Характеристика;
	МенеджерЗаписи.АртикулWB = АртикулWB;
	МенеджерЗаписи.БаркодWB = БаркодWB;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ВыгрузитьОстаткиFBO() Экспорт
	
	АЛСАВ_WB_ВыгрузкаОстатков.ВыполнитьВыгрузку(Перечисления.АЛСАВ_WB_ТипыОстатков.FBO);
	
КонецПроцедуры

Процедура ВыгрузитьОстаткиFBS() Экспорт
	
	АЛСАВ_WB_ВыгрузкаОстатков.ВыполнитьВыгрузку(Перечисления.АЛСАВ_WB_ТипыОстатков.FBS);
	
КонецПроцедуры

Процедура ЗагрузитьЗаказы() Экспорт
	
	АЛСАВ_WB_ЗагрузкаЗаказов.ВыполнитьЗагрузку();
	
КонецПроцедуры
